app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."complete" = $1  [["complete", "t"]]
---
  def completed
  	@checked = Item.where(complete: true)