app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."complete" = $1  ORDER BY priority DESC  [["complete", "f"]]
---
  def index
	# @items = Item.all
  	@items = Item.where(complete: false)

INSERT INTO "items" ("name", "description", "priority", "complete", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Pay taxes"], ["description", "use turbotax"], ["priority", 9], ["complete", "f"], ["created_at", "2016-05-25 00:09:06.102955"], ["updated_at", "2016-05-25 00:09:06.102955"]]
---
  def create
	@item = Item.create(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "Put the garbage cans out by the curb on Tuesday"], ["updated_at", "2016-05-24 21:12:24.309779"], ["id", 1]]
---
  def update
  	@item = Item.find(params[:id])

  	if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]
---
  def destroy
  	@item = Item.find(params[:id])
  	@item.destroy