app/controllers/static_pages_controller.rb

SELECT "items".* FROM "items" WHERE "items"."complete" = $1  [["complete", "t"]]
---
  def home
  	@items = Item.all
  	@checked = Item.where(complete: true)